In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.9.3-py2.py3-none-any.whl (47 kB)
Installing collected packages: pymysql
Successfully installed pymysql-0.9.3

In [2]:
import pymysql

In [3]:
# MySQL Connection 연결, root 계정으로 pydb를사전에 생성할 것.
conn = pymysql.connect(host='localhost', user='root', password='1234',
                       db='pydb', charset='utf8')

# 커서라는 개념을 사용
cursor = conn.cursor()

# 테이블 삭제
cursor.execute('''
  DROP TABLE book
''')

0

In [4]:
# 커서를 통해 테이블 만들기
cursor.execute('''
CREATE TABLE book(
  no    INT      NOT NULL AUTO_INCREMENT PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATETIME NOT NULL
)
''')

# cursor.close()
# conn.close()

0

In [5]:
# 등록
sql = '''
INSERT INTO book (name, phone, email, rdate) VALUES(%s, %s, %s, now())
''' 
cursor.execute(sql, ('홍길순', '021-322-1542', 'mail2@mail.com'))
id = cursor.lastrowid  # PK return
print(id)
cursor.execute(sql, ('나길순', '021-322-1542', 'mail3@mail.com'))
id = cursor.lastrowid  # PK return
print(id)
cursor.execute(sql, ('다길순', '021-322-1542', 'mail3@mail.com'))
id = cursor.lastrowid  # PK return
print(id)
conn.commit()

1
2
3

In [6]:
# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 1, NAME: 홍길순, PHONE: 021-322-1542, EMAIL: mail2@mail.com rdate:2020-06-26 11:55:11
NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11

In [7]:
# 한건의 레코드 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=%s
'''
cursor.execute(sql, (1))

row = cursor.fetchone() # 하나의 레코드 산출
print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 1, NAME: 홍길순, PHONE: 021-322-1542, EMAIL: mail2@mail.com rdate:2020-06-26 11:55:11

In [8]:
# 한 건의 레코드 복합 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=%s and name=%s
'''
cursor.execute(sql, (1 ,'홍길순'))

row = cursor.fetchone() # 하나의 레코드 산출
if row != None:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('일치하는 레코드가 없습니다.')

NO: 1, NAME: 홍길순, PHONE: 021-322-1542, EMAIL: mail2@mail.com rdate:2020-06-26 11:55:11

In [9]:
# 수정, 업데이트
sql='''
  UPDATE book 
  SET name=%s, phone=%s, email=%s 
  WHERE no=%s
'''
cursor.execute(sql, ('왕눈이', '010-123-1234', 'mail10@mail.com', 1))
conn.commit()

sql='''
  SELECT no, name, phone, email, rdate
  FROM book
  WHERE no=%s
'''
cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
cursor.execute(sql, (1))

row = cursor.fetchone() # 하나의 레코드 산출
print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 1, NAME: 왕눈이, PHONE: 010-123-1234, EMAIL: mail10@mail.com rdate:2020-06-26 11:55:11

In [10]:
# 삭제
sql='''
  DELETE FROM book
  WHERE no=%s
'''
cursor.execute(sql, (1))
conn.commit()

cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11

In [11]:
cursor.close()
conn.close()

In [12]:
# MYSQL을 Pandas로 바로 가져오기
import pandas as pd
import pymysql

conn = pymysql.connect(host='localhost', user='root', password='1234',
                       db='pydb', charset='utf8')

# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''

df = pd.read_sql(sql, conn)

conn.close()

df

   no name         phone           email               rdate
0   2  나길순  021-322-1542  mail3@mail.com 2020-06-26 11:55:11
1   3  다길순  021-322-1542  mail3@mail.com 2020-06-26 11:55:11

In [13]:
# no의 가장 큰 값 구하기
max_val= max(df['no'])
max_val

3

In [14]:
# DataFrame에 1명의 주소를 추가할 것
new_row = {'no':max_val+1, 'name':'아로미', 'phone':'000-1111-1111', \
           'email':'mail7@mail.com', 'rdate':'2020-06-25 17:00:00'}
df = df.append(new_row, ignore_index=True)
df

   no name          phone           email                rdate
0   2  나길순   021-322-1542  mail3@mail.com  2020-06-26 11:55:11
1   3  다길순   021-322-1542  mail3@mail.com  2020-06-26 11:55:11
2   4  아로미  000-1111-1111  mail7@mail.com  2020-06-25 17:00:00

In [15]:
# MySQL datetime 형식으로 변환
df['rdate'] = pd.to_datetime(df['rdate'])

In [16]:
# MySQL 모든 레코드 삭제
conn = pymysql.connect(host='localhost', user='root', password='1234',
                       db='pydb', charset='utf8')

sql='''
  DELETE FROM book
'''

cursor = conn.cursor()

cursor.execute(sql)
conn.commit()

cursor = conn.cursor() # commit() 실행 후에는 cursor를 다시 가져올 것.
sql = '''
  SELECT no, name, phone, email
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} ".format(row[0], row[1], row[2], row[3]))

cursor.close()
conn.close()

In [17]:
# mysql을 가져옴
!pip install pymysql
# pandas를 mysql로 저장
!pip install sqlalchemy 
!pip install mysql-connector-python-rf

Requirement already satisfied: pymysql in c:\programdata\anaconda3\envs\ai\lib\site-packages (0.9.3)
Requirement already satisfied: sqlalchemy in c:\programdata\anaconda3\envs\ai\lib\site-packages (1.3.17)
Requirement already satisfied: mysql-connector-python-rf in c:\programdata\anaconda3\envs\ai\lib\site-packages (2.2.2)

In [18]:
import pymysql
import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

In [19]:
# pandas를 mysql로 저장
engine = create_engine('mysql+pymysql://root:1234@localhost:3306/pydb', echo=False)
df.to_sql(name='book', con=engine, if_exists='append', index=False)

In [20]:
# 등록 확인
# 목록
conn = pymysql.connect(host='localhost', user='root', password='1234',
                       db='pydb', charset='utf8')
cursor = conn.cursor()

sql = '''
  SELECT no, name, phone, email, rdate
  FROM book
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    print ("NO: {0}, NAME: {1}, PHONE: {2}, EMAIL: {3} rdate:{4}".format(row[0], row[1], row[2], row[3], row[4]))

cursor.close()
conn.close()

NO: 2, NAME: 나길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11
NO: 3, NAME: 다길순, PHONE: 021-322-1542, EMAIL: mail3@mail.com rdate:2020-06-26 11:55:11
NO: 4, NAME: 아로미, PHONE: 000-1111-1111, EMAIL: mail7@mail.com rdate:2020-06-25 17:00:00

In [ ]:
# mysql은 레코드 등록시 auto_increment 속성으로 no를 명시하지 않아도 자동 증가됨
# 이제 no를 직접 명시해도 오류 없이 사용 가능해짐
SELECT * FROM book;

INSERT INTO book(name, phone, email, rdate)
VALUES('김수현', '111-1111-1111', 'mail1', NOW());

INSERT INTO book(name, phone, email, rdate)
VALUES('서예지', '111-1111-1111', 'mail1', NOW());

-- auto increment 무시한 등록
INSERT INTO book(no, name, phone, email, rdate)
VALUES(7, '주지훈', '111-1111-1111', 'mail1', NOW());

-- 에러 발생안되고 no 칼럼의 값으로 8이 등록됨
INSERT INTO book(name, phone, email, rdate)
VALUES('배두나', '111-1111-1111', 'mail1', NOW());